/*===========================================================================================
概　略：プレイヤー画面の背景のヘッダー作成
作成日：10月26日
更新日：
制作者：Yu Nishimukai
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "UnitBase.h"
#include "Sprite.h"

//ユニットベースクラスを継承
class BackGround : public UnitBase
{
	//スプライトクラスのオブジェクト作成
	Sprite sprite;

	Sprite spriteB;

public:
	BackGround();		//コンストラクタ
	~BackGround();		//デストラクタ

	HRESULT Load();		//読み込み処理
	HRESULT Render();	//描画処理
};
