/*===========================================================================================
概　略：プレイシーンを扱う処理
作成日：10月26日
更新日：
制作者：Yu Nishimukai
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "SceneBase.h"
#include <vector>

//―――――――――――――――――――――
//	プレイシーンクラス
//―――――――――――――――――――――
class PlayScene : public SceneBase
{
public:
	//コンストラクタ
	PlayScene();

	HRESULT Update();
};
