/*===========================================================================================
概　略：チュートリアルシーンを扱う処理
作成日：01月22日
更新日：
制作者：Yu Nishimukai
=============================================================================================*/

//---------------インクルード-----------------------
#include "TutorialScene.h"
#include "Tutorial.h"

//――――――――――――――――――――――
//	コンストラクタ
//――――――――――――――――――――――
TutorialScene::TutorialScene()
{
	//ユニットを追加
	unit.push_back(new Tutorial);
}

